Revit 2027 API
FluidType.GetTemperature Method
 Gets a copy of the FluidTemperature object matching a given temperature value.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FluidTemperature GetTemperature(
	double temperature
)
Public Function GetTemperature (
	temperature As Double
) As FluidTemperature
public:
FluidTemperature^ GetTemperature(
	double temperature
)
member GetTemperature :
        temperature : float -> FluidTemperature
Parameters
temperature Double
 The temperature value.
Return Value
FluidTemperature
 The fluid temperature. null if not found.
Remarks
 Changes made to this object will not be applied to the FluidType object. In order to modify the FluidTemperature settings for a given temperature, you should remove the existing FluidTemperature (RemoveTemperature()) and then add the modified value (AddTemperature()).
See Also
Reference
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace